import chat1 from "../images/Chat/c1.jpg";
import chat2 from "../images/Chat/c2.jpg";
import chat3 from "../images/Chat/c3.jpg";
import chat4 from "../images/Chat/c4.jpg";
import chat5 from "../images/Chat/c5.jpg";
import chat6 from "../images/Chat/c6.jpg";
import chat7 from "../images/Chat/c7.jpg";
import chat8 from "../images/Chat/c8.jpg";
import chat9 from "../images/Chat/c9.jpg";
import chat10 from "../images/Chat/c10.jpg";
import chat11 from "../images/Chat/c11.jpg";
import chat12 from "../images/Chat/c12.jpg";
import chat13 from "../images/Chat/c13.jpg";

import t1 from "../images/Tran/t1.jpg";
import t2 from "../images/Tran/t2.jpg";
import t3 from "../images/Tran/t3.jpg";
import t4 from "../images/Tran/t4.jpg";

import d1 from "../images/Dek/p1.jpg";
import d2 from "../images/Dek/p2.jpg";
import d3 from "../images/Dek/p3.jpg";
import d4 from "../images/Dek/p4.jpg";
import d5 from "../images/Dek/p5.jpg";
import d6 from "../images/Dek/p6.jpg";
import d7 from "../images/Dek/p7.jpg";
import d8 from "../images/Dek/p8.jpg";
import d9 from "../images/Dek/p9.jpg";
import d10 from "../images/Dek/p10.jpg";

import Happy from "../images/Dek/hap.jpg";


export const albums_Chat = [chat1 , chat2 ,chat3, chat4 , chat5 , chat6 , chat7 , chat8 , chat9 , chat10 ,chat11 , chat12 , chat13];

export const albums_T = [t1 , t2 ,t3 , t4];

export const hap = [Happy]

export const albums_Dek = [d1 , d2 ,d3 , d4 , d5 ,d6 , d7 , d8, d9 ,d10];

export const _messagesDek = [
"เริ่มจากอะไรก่อนดี เว็บนี้รวมทั้งสองเหตุการณ์สำคัญเอาไว้สองอย่างเลย ทั้งวันเกิดหนูวันที่ 9 เมษา แล้วก็วันครบรอบ  1  ปี  10  เมษา",
"เริ่มจากครบรอบ 1 ปีก่อนละกัน ยอมรับตามตรงว่าช่วงแรกที่คบกันสำหรับพี่มันไม่ดีเลย พี่เคยคิดว่าคิดผิดที่ขอหนูคบด้วย เคยบอกไปแล้วแหละ(ถ้าจำได้นะ หึหึ) เพราะตอนนั้นหนูไม่สนใจพี่เลย เอาแต่เล่นเกม แชทไม่ตอบ ไม่ได้จะเล่าเพื่อให้รู้สึกผิดนะ ก็แค่อยากเล่าให้ฟัง",
"ในช่วงที่ไม่ดีของพี่ ก็มีหนูอยู่ข้างๆพี่ตลอดเลย ถึงแม้จะขี้ลืมไปหน่อย แล้วทำให้พี่นอยอยู่บ่อยๆ",
"แต่ก็ขอบคุณหนูนะที่ยอมปรับอะไรบางอย่างให้กับความสัมพันธ์ครั้งนี้ มันอาจจะยากบ้าง ง่ายบ้าง แต่หนูก็ทำให้เห็นว่าหนูก็พยายามในส่วนตรงอยู่ ซึ่งพี่ขอบคุณมากๆครับ",
"แล้วก็ขอโทษสำหรับอะไรที่ผ่านๆมาที่พี่ทำไปแล้วหนูไม่ชอบ ไม่โอเค พี่ก็จะพยายามปรับให้เข้ากับหนูเหมือนกันครับ",
"เอาเป็นว่าขอบคุณสำหรับ 1 ปีที่ผ่านมานะครับ เป็น 1 ปีที่ดีมากๆสำหรับพี่ พี่ก็ไม่รู้เราจะได้คบกันอีกนานแค่ไหน แต่พี่ไม่อยากที่จะเริ่มต้นความสัมพันธ์ใหม่อีกแล้วล่ะ ขอแค่ตื่นมาเจอหนูในวันพรุ่งนี้ของทุกๆวันก็พอครับ",
"Happy Our 1st Anniversary",
"(รูปสุดท้ายแถมนะ ชอบมากมาก)"
];

export const _messagesBD = [
    "Happy Birthday, my love.",
    "Just like last year, you're still my favorite person in the world.",
    "No matter what challenges come your way, I'll always be right here holding your hand and never letting go.",
    "Love you",
    "Forever yours 💕 ",
    "(รูปนี้ เป็นรูปเมื่อปีที่แล้วพี่ทำไว้)"
    ];

export const _messagesChat = [
    "นี่เป็นแชทช่วงแรกๆที่คุยกันตั้งแต่เริ่มคุยกันจนถึงปัจจุบันเลย คือมันก็ไม่ได้มีโมเมนต์เยอะอะไรขนาดนั้นหรอก ก็มีแค่ที่พี่แคปๆมาตามช่วงนั้นๆน่ะ มันก็มีทั้งดีแล้วก็ไม่ดี",
    "ก็อย่างว่า 1 ปีนี่ก็นานอยู่นะ ทะเลาะกันมาก็เยอะ(เรียกทะเลาะได้มั้ยนะ) เอาเป็นว่าเรียกปรับความเข้าใจกันน่าจะดีกว่า เพราะพี่รู้สึกว่าเป็นคำๆนี้มากกว่าทะเลาะ",
    "ส่วนใน Part ที่ดีก็มีเยอะเลย โดนเด็กจีบตั้งแต่แรกขยันเล่นมุขมากมาก ขอบคุณสำหรับความน่ารักที่ผ่านๆมาจนถึงตอนนี้ แล้วก็ขอบคุณที่เข้าหาพี่ในวันนั้นนะครับ พี่มีความสุขมากๆเลย"
    ];

export const _messagesJoke = [
    "อันนี้เป็นคำภาษาจีน ที่หนูเอามาเล่นกับพี่แล้วเอาไปแปล ไอตูดจริงๆ",
    ];

export const _messagesLast = [
    "เว็บนี้พี่ตั้งใจทำมากๆ ถึงจะไม่ได้ทำเองทั้งหมด(ไปเอาของคนอื่นมาบ้าง) แต่ก็อยากจะเก็บไว้เป็น Memory น่ะ ไม่รู้ว่าจะชอบมั้ย อาจจะอ่านเยอะหน่อย ยังไงก็มาบอกด้วยนะว่าชอบมั้ย",
    "ไอตูดเอ้ยยย"
    ];